dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/Battery_draw.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

//#include "FreeRTOS.h"
//#include "task.h"

#include <core/lv_obj_scroll.h>
#include "fsl_debug_console.h"
#include "lvgl_support.h"
#include "pin_mux.h"
#include "board.h"
#include "lvgl.h"
#include "gui_guider.h"
#include "events_init.h"
#include "custom.h"


// Screen task
#include "Screen_Task.h"

#define BATTERY_LINE_OPA 160

#define BATTERY_LEFT_LINE_A_LINE_1_X_START 226
#define BATTERY_LEFT_LINE_A_LINE_1_X_END   (BATTERY_LEFT_LINE_A_LINE_1_X_START-8)
#define BATTERY_LEFT_LINE_A_LINE_1_Y_START 445 //369
#define BATTERY_LEFT_LINE_A_LINE_1_Y_END   (BATTERY_LEFT_LINE_A_LINE_1_Y_START)

#define BATTERY_LEFT_LINE_A_LINE_2_X_START (BATTERY_LEFT_LINE_A_LINE_1_X_END)
#define BATTERY_LEFT_LINE_A_LINE_2_X_END   (BATTERY_LEFT_LINE_A_LINE_2_X_START-20+7)
#define BATTERY_LEFT_LINE_A_LINE_2_Y_START BATTERY_LEFT_LINE_A_LINE_1_Y_END
#define BATTERY_LEFT_LINE_A_LINE_2_Y_END   (BATTERY_LEFT_LINE_A_LINE_2_Y_START)

#define BATTERY_LEFT_LINE_A_LINE_3_X_START (BATTERY_LEFT_LINE_A_LINE_2_X_END)
#define BATTERY_LEFT_LINE_A_LINE_3_X_END   (BATTERY_LEFT_LINE_A_LINE_3_X_START-20)
#define BATTERY_LEFT_LINE_A_LINE_3_Y_START BATTERY_LEFT_LINE_A_LINE_2_Y_END
#define BATTERY_LEFT_LINE_A_LINE_3_Y_END   (BATTERY_LEFT_LINE_A_LINE_3_Y_START)

#define BATTERY_LEFT_LINE_A_LINE_4_X_START (BATTERY_LEFT_LINE_A_LINE_3_X_END)
#define BATTERY_LEFT_LINE_A_LINE_4_X_END   (BATTERY_LEFT_LINE_A_LINE_4_X_START-20)
#define BATTERY_LEFT_LINE_A_LINE_4_Y_START BATTERY_LEFT_LINE_A_LINE_3_Y_END
#define BATTERY_LEFT_LINE_A_LINE_4_Y_END   (BATTERY_LEFT_LINE_A_LINE_4_Y_START)

#define BATTERY_LEFT_LINE_A_LINE_5_X_START (BATTERY_LEFT_LINE_A_LINE_4_X_END)
#define BATTERY_LEFT_LINE_A_LINE_5_X_END   (BATTERY_LEFT_LINE_A_LINE_5_X_START-20)
#define BATTERY_LEFT_LINE_A_LINE_5_Y_START BATTERY_LEFT_LINE_A_LINE_4_Y_END
#define BATTERY_LEFT_LINE_A_LINE_5_Y_END   (BATTERY_LEFT_LINE_A_LINE_5_Y_START)

#define BATTERY_LEFT_LINE_A_LINE_6_X_START (BATTERY_LEFT_LINE_A_LINE_5_X_END)
#define BATTERY_LEFT_LINE_A_LINE_6_X_END   (BATTERY_LEFT_LINE_A_LINE_6_X_START-20)
#define BATTERY_LEFT_LINE_A_LINE_6_Y_START BATTERY_LEFT_LINE_A_LINE_5_Y_END
#define BATTERY_LEFT_LINE_A_LINE_6_Y_END   (BATTERY_LEFT_LINE_A_LINE_6_Y_START)

#define BATTERY_LEFT_LINE_A_LINE_7_X_START (BATTERY_LEFT_LINE_A_LINE_6_X_END)
#define BATTERY_LEFT_LINE_A_LINE_7_X_END   (BATTERY_LEFT_LINE_A_LINE_7_X_START-20)
#define BATTERY_LEFT_LINE_A_LINE_7_Y_START BATTERY_LEFT_LINE_A_LINE_6_Y_END
#define BATTERY_LEFT_LINE_A_LINE_7_Y_END   (BATTERY_LEFT_LINE_A_LINE_7_Y_START)

#define BATTERY_LEFT_LINE_A_LINE_8_X_START (BATTERY_LEFT_LINE_A_LINE_7_X_END)
#define BATTERY_LEFT_LINE_A_LINE_8_X_END   (BATTERY_LEFT_LINE_A_LINE_8_X_START-20)
#define BATTERY_LEFT_LINE_A_LINE_8_Y_START BATTERY_LEFT_LINE_A_LINE_7_Y_END
#define BATTERY_LEFT_LINE_A_LINE_8_Y_END   (BATTERY_LEFT_LINE_A_LINE_8_Y_START)

#define BATTERY_LEFT_LINE_A_LINE_9_X_START (BATTERY_LEFT_LINE_A_LINE_8_X_END)
#define BATTERY_LEFT_LINE_A_LINE_9_X_END   (BATTERY_LEFT_LINE_A_LINE_9_X_START-20)
#define BATTERY_LEFT_LINE_A_LINE_9_Y_START BATTERY_LEFT_LINE_A_LINE_8_Y_END
#define BATTERY_LEFT_LINE_A_LINE_9_Y_END   (BATTERY_LEFT_LINE_A_LINE_9_Y_START)

#define BATTERY_LEFT_LINE_A_LINE_10_X_START (BATTERY_LEFT_LINE_A_LINE_9_X_END)   //124
#define BATTERY_LEFT_LINE_A_LINE_10_X_END   (BATTERY_LEFT_LINE_A_LINE_10_X_START-20) //360
#define BATTERY_LEFT_LINE_A_LINE_10_Y_START BATTERY_LEFT_LINE_A_LINE_9_Y_END         // 113
#define BATTERY_LEFT_LINE_A_LINE_10_Y_END   (BATTERY_LEFT_LINE_A_LINE_10_Y_START)  // 359



uint8_t battery_left_draw_line_1_first_draw_forward = 1;
uint8_t battery_left_draw_line_1_first_draw_forward_switch = 1;
uint8_t battery_left_draw_line_1_draw_backward_switch = 0;
uint8_t battery_left_draw_line_1_draw_backward_switch_case = 0;
uint8_t battery_left_draw_line_1_draw_forward_switch = 0;
uint8_t battery_left_draw_line_1_draw_forward_switch_case = 0;
uint8_t battery_line_1_start_timer;
uint8_t battery_line_1_start_timer_exp;

extern volatile uint32_t battery_drawing_screen;
extern volatile uint32_t battery_drawing_screen_inc_enable;
extern volatile uint8_t  battery_left_start_drawing;
extern volatile uint8_t temp_start_drawing;

volatile uint8_t battery_left_init_entry;

//#define LEFT_DRAW_LINE_1_COLOR_RED 1

void battery_draw(void)
{
//static lv_point_t line_points[] = { {214, 369}, {88, 357}};
//
//    /*Create style*/
//    static lv_style_t style_line;
//    lv_style_init(&style_line);
//    lv_style_set_line_width(&style_line, 12);
//    lv_style_set_line_color(&style_line, lv_palette_main(LV_PALETTE_RED));
//    lv_style_set_line_rounded(&style_line, false);
//
//    /*Create a line and apply the new style*/
//    lv_obj_t * line1;
//    line1 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//    lv_line_set_points(line1, line_points, 2);     /*Set the points*/
//    lv_obj_add_style(line1, &style_line, 0);
//    //lv_obj_center(line1);

	if(battery_left_init_entry == 0)
	{
		battery_line_1_start_timer = 1;
		battery_line_1_start_timer_exp = 1;
		battery_left_draw_line_1_first_draw_forward = 1;

		battery_left_init_entry = 1;
	}

#ifndef LEFT_DRAW_LINE_1_COLOR_RED
	//lv_color_t first_line_color = LV_COLOR_MAKE(0,0,255);
	lv_color_t first_line_color = LV_COLOR_MAKE(0x1e, 0xca, 0x1c);
#endif
	//lv_color_t last_line_color = LV_COLOR_MAKE(254,43,43);
	lv_color_t last_line_color = LV_COLOR_MAKE(168,16,31);
	//lv_color_t last_line_color = LV_COLOR_MAKE(255,85,85);
	//lv_color_t last_line_color = LV_COLOR_MAKE(255,0,0);

//	static lv_style_t style_line_L_11;
//	lv_style_init(&style_line_L_11);
//	lv_style_set_line_rounded(&style_line_L_11, false);

//	static lv_style_t style_line_L_fix;
//	lv_style_init(&style_line_L_fix);
//	lv_style_set_line_rounded(&style_line_L_fix, false);
//
//	static lv_style_t style_line_L_fix_temp;
//	lv_style_init(&style_line_L_fix_temp);
//	lv_style_set_line_rounded(&style_line_L_fix_temp, false);

	//battery_left_draw_line_1_first_draw_forward_switch = 13;
	//while(1)
	if(battery_left_start_drawing)
	{
		if(battery_line_1_start_timer_exp)
		{
			//while(1)
			if(battery_left_draw_line_1_first_draw_forward)
			{
				switch(battery_left_draw_line_1_first_draw_forward_switch)
				{

				case 1 :
					;
					lv_obj_clear_flag(guider_ui.screen_drawing_canvas_triangle_L_1, LV_OBJ_FLAG_HIDDEN);
					battery_left_draw_line_1_first_draw_forward_switch++;
					break;

				case 2 :
					;
					lv_obj_clear_flag(guider_ui.screen_drawing_canvas_triangle_L_2, LV_OBJ_FLAG_HIDDEN);
					battery_left_draw_line_1_first_draw_forward_switch++;
					break;

				case 3 :
					;
					lv_obj_clear_flag(guider_ui.batteryline1, LV_OBJ_FLAG_HIDDEN);
//					// Line - 1
//					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
//					//12 lines : x = 128/12 = 10.66 = -(10+1)
//					// starting -- x = prev line ending (x +1)
//					//static lv_point_t line_points[] = { {214, 369}, {203, 368}};
//					static lv_point_t line_points[] = { {BATTERY_LEFT_LINE_A_LINE_1_X_START, BATTERY_LEFT_LINE_A_LINE_1_Y_START}, {BATTERY_LEFT_LINE_A_LINE_1_X_END, BATTERY_LEFT_LINE_A_LINE_1_Y_END}};
//					//lv_color_t
//					/*Create style*/
//					static lv_style_t style_line;
//					lv_style_init(&style_line);
//					lv_style_set_line_width(&style_line, 12);
//#ifndef LEFT_DRAW_LINE_1_COLOR_RED
//					//lv_style_set_line_opa(&style_line, 56);
//					lv_style_set_line_color(&style_line, first_line_color);
//#else
//					lv_style_set_line_color(&style_line, lv_palette_main(LV_PALETTE_RED));
//#endif
//					lv_style_set_line_rounded(&style_line, false);
//					/*Create a line and apply the new style*/
//					//lv_obj_t * line1;
//					guider_ui.batteryline1 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.batteryline1, line_points, 2);     /*Set the points*/
//					lv_obj_add_style(guider_ui.batteryline1, &style_line, 0);
//					//lv_obj_center(line1);
//					//lv_task_handler();  // Update the display
					battery_left_draw_line_1_first_draw_forward_switch++;
					break;

