dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/Battery_draw.c
				case 4 :
					;
					lv_obj_clear_flag(guider_ui.batteryline2, LV_OBJ_FLAG_HIDDEN);
//					// Line - 2
//					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
//					//12 lines : x = 128/12 = 10.66 = 10+1
//					// starting -- x = prev line ending (x +1)
//					//static lv_point_t line_points_L_1[] = { {204, 368}, {193, 367}};
//					static lv_point_t line_points_L_1[] = { {BATTERY_LEFT_LINE_A_LINE_2_X_START, BATTERY_LEFT_LINE_A_LINE_2_Y_START}, {BATTERY_LEFT_LINE_A_LINE_2_X_END, BATTERY_LEFT_LINE_A_LINE_2_Y_END}};
//					/*Create style*/
//					static lv_style_t style_line_L_1;
//					lv_style_init(&style_line_L_1);
//					lv_style_set_line_width(&style_line_L_1, 12);
//#ifndef LEFT_DRAW_LINE_1_COLOR_RED
//					//lv_style_set_line_opa(&style_line_L_1, 56);
//					lv_style_set_line_color(&style_line_L_1, first_line_color);
//#else
//					lv_style_set_line_color(&style_line_L_1, lv_palette_main(LV_PALETTE_RED));
//#endif
//					lv_style_set_line_rounded(&style_line_L_1, false);
//					/*Create a line and apply the new style*/
//					//lv_obj_t * line2;
//					guider_ui.batteryline2 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.batteryline2, line_points_L_1, 2);     /*Set the points*/
//					lv_obj_add_style(guider_ui.batteryline2, &style_line_L_1, 0);
//					//lv_obj_center(line1);
//					//lv_task_handler();  // Update the display
					battery_left_draw_line_1_first_draw_forward_switch++;
					break;

				case 5 :
					;
					lv_obj_clear_flag(guider_ui.batteryline3, LV_OBJ_FLAG_HIDDEN);
//					// Line - 3
//					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
//					//12 lines : x = 128/12 = 10.66 = 10+1
//					// starting -- x = prev line ending (x +1)
//					static lv_point_t line_points_L_2[] = { {BATTERY_LEFT_LINE_A_LINE_3_X_START, BATTERY_LEFT_LINE_A_LINE_3_Y_START}, {BATTERY_LEFT_LINE_A_LINE_3_X_END, BATTERY_LEFT_LINE_A_LINE_3_Y_END}};
//					/*Create style*/
//					static lv_style_t style_line_L_2;
//					lv_style_init(&style_line_L_2);
//					lv_style_set_line_width(&style_line_L_2, 12);
//#ifndef LEFT_DRAW_LINE_1_COLOR_RED
//					////lv_style_set_line_opa(&style_line_L_2, 56);
//					lv_style_set_line_color(&style_line_L_2, first_line_color);
//#else
//					lv_style_set_line_color(&style_line_L_2, lv_palette_main(LV_PALETTE_RED));
//#endif
//					lv_style_set_line_rounded(&style_line_L_2, false);
//					/*Create a line and apply the new style*/
//					//lv_obj_t * line3;
//					guider_ui.batteryline3 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.batteryline3, line_points_L_2, 2);     /*Set the points*/
//					lv_obj_add_style(guider_ui.batteryline3, &style_line_L_2, 0);
//					//lv_obj_center(line1);
//					//lv_task_handler();  // Update the display
					battery_left_draw_line_1_first_draw_forward_switch++;
					break;

				case 6 :
					;
					lv_obj_clear_flag(guider_ui.batteryline4, LV_OBJ_FLAG_HIDDEN);
//					// Line - 4
//					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
//					//12 lines : x = 128/12 = 10.66 = 10+1
//					// starting -- x = prev line ending (x +1)
//					static lv_point_t line_points_L_3[] = { {BATTERY_LEFT_LINE_A_LINE_4_X_START, BATTERY_LEFT_LINE_A_LINE_4_Y_START}, {BATTERY_LEFT_LINE_A_LINE_4_X_END, BATTERY_LEFT_LINE_A_LINE_4_Y_END}};
//					/*Create style*/
//					static lv_style_t style_line_L_3;
//					lv_style_init(&style_line_L_3);
//					lv_style_set_line_width(&style_line_L_3, 12);
//#ifndef LEFT_DRAW_LINE_1_COLOR_RED
//					//lv_style_set_line_opa(&style_line_L_3, 56);
//					lv_style_set_line_color(&style_line_L_3, first_line_color);
//#else
//					lv_style_set_line_color(&style_line_L_3, lv_palette_main(LV_PALETTE_RED));
//#endif
//					lv_style_set_line_rounded(&style_line_L_3, false);
//					/*Create a line and apply the new style*/
//					//lv_obj_t * line4;
//					guider_ui.batteryline4 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.batteryline4, line_points_L_3, 2);     /*Set the points*/
//					lv_obj_add_style(guider_ui.batteryline4, &style_line_L_3, 0);
//					//lv_obj_center(line1);
//					//lv_task_handler();  // Update the display
					battery_left_draw_line_1_first_draw_forward_switch++;
					break;

				case 7 :
					;
					lv_obj_clear_flag(guider_ui.batteryline5, LV_OBJ_FLAG_HIDDEN);
//					// Line - 5
//					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
//					//12 lines : x = 128/12 = 10.66 = 10+1
//					// starting -- x = prev line ending (x +1)
//					static lv_point_t line_points_L_4[] = { {BATTERY_LEFT_LINE_A_LINE_5_X_START, BATTERY_LEFT_LINE_A_LINE_5_Y_START}, {BATTERY_LEFT_LINE_A_LINE_5_X_END, BATTERY_LEFT_LINE_A_LINE_5_Y_END}};
//					/*Create style*/
//					static lv_style_t style_line_L_4;
//					lv_style_init(&style_line_L_4);
//					lv_style_set_line_width(&style_line_L_4, 12);
//#ifndef LEFT_DRAW_LINE_1_COLOR_RED
//					//lv_style_set_line_opa(&style_line_L_4, 56);
//					lv_style_set_line_color(&style_line_L_4, first_line_color);
//#else
//					lv_style_set_line_color(&style_line_L_4, lv_palette_main(LV_PALETTE_RED));
//#endif
//					lv_style_set_line_rounded(&style_line_L_4, false);
//					/*Create a line and apply the new style*/
//					//lv_obj_t * line5;
//					guider_ui.batteryline5 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.batteryline5, line_points_L_4, 2);     /*Set the points*/
//					lv_obj_add_style(guider_ui.batteryline5, &style_line_L_4, 0);
//					//lv_obj_center(line1);
//					//lv_task_handler();  // Update the display
					battery_left_draw_line_1_first_draw_forward_switch++;
					break;

				case 8 :
					;
					lv_obj_clear_flag(guider_ui.batteryline6, LV_OBJ_FLAG_HIDDEN);
//					// Line - 6
//					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
//					//12 lines : x = 128/12 = 10.66 = 10+1
//					// starting -- x = prev line ending (x +1)
//					static lv_point_t line_points_L_5[] = { {BATTERY_LEFT_LINE_A_LINE_6_X_START, BATTERY_LEFT_LINE_A_LINE_6_Y_START}, {BATTERY_LEFT_LINE_A_LINE_6_X_END, BATTERY_LEFT_LINE_A_LINE_6_Y_END}};
//					/*Create style*/
//					static lv_style_t style_line_L_5;
//					lv_style_init(&style_line_L_5);
//					lv_style_set_line_width(&style_line_L_5, 12);
//#ifndef LEFT_DRAW_LINE_1_COLOR_RED
//					//lv_style_set_line_opa(&style_line_L_5, 56);
//					lv_style_set_line_color(&style_line_L_5, first_line_color);
//#else
//					lv_style_set_line_color(&style_line_L_5, lv_palette_main(LV_PALETTE_RED));
//#endif
//					lv_style_set_line_rounded(&style_line_L_5, false);
//					/*Create a line and apply the new style*/
//					//lv_obj_t * line6;
//					guider_ui.batteryline6 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.batteryline6, line_points_L_5, 2);     /*Set the points*/
//					lv_obj_add_style(guider_ui.batteryline6, &style_line_L_5, 0);
//					//lv_obj_center(line1);
//					//lv_task_handler();  // Update the display
					battery_left_draw_line_1_first_draw_forward_switch++;

	    			// start drawing temp screen
					temp_start_drawing = 1;

					break;

				case 9 :
					;
					lv_obj_clear_flag(guider_ui.batteryline7, LV_OBJ_FLAG_HIDDEN);
//					// Line - 7
//					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
//					//12 lines : x = 128/12 = 10.66 = 10+1
//					// starting -- x = prev line ending (x +1)
//					static lv_point_t line_points_L_6[] = { {BATTERY_LEFT_LINE_A_LINE_7_X_START, BATTERY_LEFT_LINE_A_LINE_7_Y_START}, {BATTERY_LEFT_LINE_A_LINE_7_X_END, BATTERY_LEFT_LINE_A_LINE_7_Y_END}};
//					/*Create style*/
//					static lv_style_t style_line_L_6;
//					lv_style_init(&style_line_L_6);
//					lv_style_set_line_width(&style_line_L_6, 12);
//#ifndef LEFT_DRAW_LINE_1_COLOR_RED
//					//lv_style_set_line_opa(&style_line_L_6, 56);
//					lv_style_set_line_color(&style_line_L_6, first_line_color);
//#else
//					lv_style_set_line_color(&style_line_L_6, lv_palette_main(LV_PALETTE_RED));
//#endif
//					lv_style_set_line_rounded(&style_line_L_6, false);
//					/*Create a line and apply the new style*/
//					//lv_obj_t * line7;
//					guider_ui.batteryline7 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.batteryline7, line_points_L_6, 2);     /*Set the points*/
//					lv_obj_add_style(guider_ui.batteryline7, &style_line_L_6, 0);
//					//lv_obj_center(line1);
//					//lv_task_handler();  // Update the display
					battery_left_draw_line_1_first_draw_forward_switch++;
					break;

				case 10 :
					;
					lv_obj_clear_flag(guider_ui.batteryline8, LV_OBJ_FLAG_HIDDEN);
//					// Line - 8
//					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
//					//12 lines : x = 128/12 = 10.66 = 10+1
//					// starting -- x = prev line ending (x +1)
//					static lv_point_t line_points_L_7[] = { {BATTERY_LEFT_LINE_A_LINE_8_X_START, BATTERY_LEFT_LINE_A_LINE_8_Y_START}, {BATTERY_LEFT_LINE_A_LINE_8_X_END, BATTERY_LEFT_LINE_A_LINE_8_Y_END}};
//					/*Create style*/
//					static lv_style_t style_line_L_7;
//					lv_style_init(&style_line_L_7);
//					lv_style_set_line_width(&style_line_L_7, 12);
//#ifndef LEFT_DRAW_LINE_1_COLOR_RED
//					//lv_style_set_line_opa(&style_line_L_7, 56);
//					lv_style_set_line_color(&style_line_L_7, first_line_color);
//#else
//					lv_style_set_line_color(&style_line_L_7, lv_palette_main(LV_PALETTE_RED));
//#endif
//					lv_style_set_line_rounded(&style_line_L_7, false);
//					/*Create a line and apply the new style*/
//					//lv_obj_t * line8;
//					guider_ui.batteryline8 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.batteryline8, line_points_L_7, 2);     /*Set the points*/
//					lv_obj_add_style(guider_ui.batteryline8, &style_line_L_7, 0);
//					//lv_obj_center(line1);
//					//lv_task_handler();  // Update the display
					battery_left_draw_line_1_first_draw_forward_switch++;
					break;

				case 11 :
					;
					lv_obj_clear_flag(guider_ui.batteryline9, LV_OBJ_FLAG_HIDDEN);
//					// Line - 9
//					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
//					//12 lines : x = 128/12 = 10.66 = 10+1
//					// starting -- x = prev line ending (x +1)
//					static lv_point_t line_points_L_8[] = { {BATTERY_LEFT_LINE_A_LINE_9_X_START, BATTERY_LEFT_LINE_A_LINE_9_Y_START}, {BATTERY_LEFT_LINE_A_LINE_9_X_END, BATTERY_LEFT_LINE_A_LINE_9_Y_END}};
//					/*Create style*/
//					static lv_style_t style_line_L_8;
//					lv_style_init(&style_line_L_8);
//					lv_style_set_line_width(&style_line_L_8, 12);
//#ifndef LEFT_DRAW_LINE_1_COLOR_RED
//					//lv_style_set_line_opa(&style_line_L_8, 56);
//					lv_style_set_line_color(&style_line_L_8, first_line_color);
//#else
//					lv_style_set_line_color(&style_line_L_8, lv_palette_main(LV_PALETTE_RED));
//#endif
//					lv_style_set_line_rounded(&style_line_L_8, false);
//					/*Create a line and apply the new style*/
//					//lv_obj_t * line9;
//					guider_ui.batteryline9 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.batteryline9, line_points_L_8, 2);     /*Set the points*/
//					lv_obj_add_style(guider_ui.batteryline9, &style_line_L_8, 0);
//					//lv_obj_center(line1);
//					//lv_task_handler();  // Update the display
					battery_left_draw_line_1_first_draw_forward_switch++;
					break;

				case 12 :
					;
					lv_obj_clear_flag(guider_ui.batteryline10, LV_OBJ_FLAG_HIDDEN);
//					// Line - 10
//					//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
//					//12 lines : x = 128/12 = 10.66 = 10+1
//					// starting -- x = prev line ending (x +1)
//					static lv_point_t line_points_L_9[] = { {BATTERY_LEFT_LINE_A_LINE_10_X_START, BATTERY_LEFT_LINE_A_LINE_10_Y_START}, {BATTERY_LEFT_LINE_A_LINE_10_X_END, BATTERY_LEFT_LINE_A_LINE_10_Y_END}};
//					/*Create style*/
//					static lv_style_t style_line_L_9;
//					lv_style_init(&style_line_L_9);
//					lv_style_set_line_width(&style_line_L_9, 12);
//#ifndef LEFT_DRAW_LINE_1_COLOR_RED
//					//lv_style_set_line_opa(&style_line_L_9, 56);
//					lv_style_set_line_color(&style_line_L_9, first_line_color);
//#else
//					lv_style_set_line_color(&style_line_L_9, lv_palette_main(LV_PALETTE_RED));
//#endif
//					lv_style_set_line_rounded(&style_line_L_9, false);
//					/*Create a line and apply the new style*/
//					//lv_obj_t * line10;
//					guider_ui.batteryline10 = lv_line_create(guider_ui.screen_drawing_container_drawing);
//					lv_line_set_points(guider_ui.batteryline10, line_points_L_9, 2);     /*Set the points*/
//					lv_obj_add_style(guider_ui.batteryline10, &style_line_L_9, 0);
//					//lv_obj_center(line1);
//					//lv_task_handler();  // Update the display

	    			//final
	    			// first time draw completed
	    			battery_left_draw_line_1_first_draw_forward_switch=0;
	    			battery_left_draw_line_1_first_draw_forward = 0;
	    			battery_left_draw_line_1_draw_backward_switch = 1;
					break;

				default :
					break;
				}

				//lv_task_handler();  // Update the display
			}
			else
			{
				if(battery_left_draw_line_1_draw_backward_switch)
				{
					switch (battery_left_draw_line_1_draw_backward_switch_case)
					{
					case 0 :
						lv_obj_add_flag(guider_ui.batteryline10, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 1 :
						lv_obj_add_flag(guider_ui.batteryline9, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 2 :
						lv_obj_add_flag(guider_ui.batteryline8, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 3 :
						lv_obj_add_flag(guider_ui.batteryline7, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 4 :
						lv_obj_add_flag(guider_ui.batteryline6, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 5 :
						lv_obj_add_flag(guider_ui.batteryline5, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 6 :
						lv_obj_add_flag(guider_ui.batteryline4, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 7 :
						lv_obj_add_flag(guider_ui.batteryline3, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 8 :
						lv_obj_add_flag(guider_ui.batteryline2, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 9 :
						lv_obj_add_flag(guider_ui.batteryline1, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 10 :
						lv_obj_add_flag(guider_ui.screen_drawing_canvas_triangle_L_2, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						break;
					case 11 :
						lv_obj_add_flag(guider_ui.screen_drawing_canvas_triangle_L_1, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_backward_switch_case++;
						battery_left_draw_line_1_draw_backward_switch_case=0;
						battery_left_draw_line_1_draw_backward_switch = 0;
						battery_left_draw_line_1_draw_forward_switch = 1;
						battery_left_draw_line_1_draw_forward_switch_case = 0;
						break;
					default:
						break;
					}

