dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/Battery_draw.c
				}
				else if (battery_left_draw_line_1_draw_forward_switch)
				{
					switch (battery_left_draw_line_1_draw_forward_switch_case)
					{
					case 0 :
						lv_obj_clear_flag(guider_ui.screen_drawing_canvas_triangle_L_1, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 1 :
						lv_obj_clear_flag(guider_ui.screen_drawing_canvas_triangle_L_2, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 2 :
						lv_obj_clear_flag(guider_ui.batteryline1, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 3 :
						lv_obj_clear_flag(guider_ui.batteryline2, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 4 :
						lv_obj_clear_flag(guider_ui.batteryline3, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 5 :
						lv_obj_clear_flag(guider_ui.batteryline4, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 6 :
						lv_obj_clear_flag(guider_ui.batteryline5, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 7 :
						lv_obj_clear_flag(guider_ui.batteryline6, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 8 :
						lv_obj_clear_flag(guider_ui.batteryline7, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 9 :
						lv_obj_clear_flag(guider_ui.batteryline8, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 10 :
						lv_obj_clear_flag(guider_ui.batteryline9, LV_OBJ_FLAG_HIDDEN);
						battery_left_draw_line_1_draw_forward_switch_case++;
						break;
					case 11 :
						lv_obj_clear_flag(guider_ui.batteryline10, LV_OBJ_FLAG_HIDDEN);

						battery_left_draw_line_1_draw_forward_switch_case = 0;
						battery_left_draw_line_1_draw_forward_switch = 0;
						battery_left_draw_line_1_draw_backward_switch = 1;
						battery_left_draw_line_1_draw_backward_switch_case = 0;
						break;
					default:
						break;
					}

				}
				else
				{
					// do nothing
				}

			}

		}

		if(battery_line_1_start_timer)
		{
			battery_drawing_screen = 0;
			battery_drawing_screen_inc_enable = 1;

			battery_line_1_start_timer_exp = 0;
			battery_line_1_start_timer = 0;
		}
		// 35 msec : keep calling : lv_task_handler()
		if (battery_drawing_screen >= 5)  // Minimum : delay for 10 msec --> i.e animation time --> till that time call --> lv_task_handler()
		{
			battery_line_1_start_timer_exp = 1;
			battery_drawing_screen_inc_enable = 0;
			battery_line_1_start_timer = 1;

		}


		//lv_task_handler();  // Update the display

	}

}


void battery_create_lines(void)
{

#ifndef LEFT_DRAW_LINE_1_COLOR_RED
	//lv_color_t first_line_color = LV_COLOR_MAKE(0,0,255);
	lv_color_t first_line_color = LV_COLOR_MAKE(0x1e, 0xca, 0x1c);
#endif
	//lv_color_t last_line_color = LV_COLOR_MAKE(254,43,43);
	lv_color_t last_line_color = LV_COLOR_MAKE(168,16,31);


							// Line - 1
							//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
							//12 lines : x = 128/12 = 10.66 = -(10+1)
							// starting -- x = prev line ending (x +1)
							//static lv_point_t line_points[] = { {214, 369}, {203, 368}};
							static lv_point_t line_points[] = { {BATTERY_LEFT_LINE_A_LINE_1_X_START, BATTERY_LEFT_LINE_A_LINE_1_Y_START}, {BATTERY_LEFT_LINE_A_LINE_1_X_END, BATTERY_LEFT_LINE_A_LINE_1_Y_END}};
							//lv_color_t
							/*Create style*/
							static lv_style_t style_line;
							lv_style_init(&style_line);
							lv_style_set_line_width(&style_line, 12);
		#ifndef LEFT_DRAW_LINE_1_COLOR_RED
							//lv_style_set_line_opa(&style_line, BATTERY_LINE_OPA);
							lv_style_set_line_color(&style_line, last_line_color);
		#else
							lv_style_set_line_color(&style_line, lv_palette_main(LV_PALETTE_RED));
		#endif
							lv_style_set_line_rounded(&style_line, false);
							/*Create a line and apply the new style*/
							//lv_obj_t * line1;
							guider_ui.batteryline1 = lv_line_create(guider_ui.screen_drawing_container_drawing);
							lv_line_set_points(guider_ui.batteryline1, line_points, 2);     /*Set the points*/
							lv_obj_add_style(guider_ui.batteryline1, &style_line, 0);
							//lv_obj_center(line1);
							//lv_task_handler();  // Update the display

							// Line - 2
							//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
							//12 lines : x = 128/12 = 10.66 = 10+1
							// starting -- x = prev line ending (x +1)
							//static lv_point_t line_points_L_1[] = { {204, 368}, {193, 367}};
							static lv_point_t line_points_L_1[] = { {BATTERY_LEFT_LINE_A_LINE_2_X_START, BATTERY_LEFT_LINE_A_LINE_2_Y_START}, {BATTERY_LEFT_LINE_A_LINE_2_X_END, BATTERY_LEFT_LINE_A_LINE_2_Y_END}};
							/*Create style*/
							static lv_style_t style_line_L_1;
							lv_style_init(&style_line_L_1);
							lv_style_set_line_width(&style_line_L_1, 12);
		#ifndef LEFT_DRAW_LINE_1_COLOR_RED
							lv_style_set_line_opa(&style_line_L_1, BATTERY_LINE_OPA);
							lv_style_set_line_color(&style_line_L_1, first_line_color);
		#else
							lv_style_set_line_color(&style_line_L_1, lv_palette_main(LV_PALETTE_RED));
		#endif
							lv_style_set_line_rounded(&style_line_L_1, false);
							/*Create a line and apply the new style*/
							//lv_obj_t * line2;
							guider_ui.batteryline2 = lv_line_create(guider_ui.screen_drawing_container_drawing);
							lv_line_set_points(guider_ui.batteryline2, line_points_L_1, 2);     /*Set the points*/
							lv_obj_add_style(guider_ui.batteryline2, &style_line_L_1, 0);
							//lv_obj_center(line1);
							//lv_task_handler();  // Update the display

							// Line - 3
							//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
							//12 lines : x = 128/12 = 10.66 = 10+1
							// starting -- x = prev line ending (x +1)
							static lv_point_t line_points_L_2[] = { {BATTERY_LEFT_LINE_A_LINE_3_X_START, BATTERY_LEFT_LINE_A_LINE_3_Y_START}, {BATTERY_LEFT_LINE_A_LINE_3_X_END, BATTERY_LEFT_LINE_A_LINE_3_Y_END}};
							/*Create style*/
							static lv_style_t style_line_L_2;
							lv_style_init(&style_line_L_2);
							lv_style_set_line_width(&style_line_L_2, 12);
		#ifndef LEFT_DRAW_LINE_1_COLOR_RED
							lv_style_set_line_opa(&style_line_L_2, BATTERY_LINE_OPA);
							lv_style_set_line_color(&style_line_L_2, first_line_color);
		#else
							lv_style_set_line_color(&style_line_L_2, lv_palette_main(LV_PALETTE_RED));
		#endif
							lv_style_set_line_rounded(&style_line_L_2, false);
							/*Create a line and apply the new style*/
							//lv_obj_t * line3;
							guider_ui.batteryline3 = lv_line_create(guider_ui.screen_drawing_container_drawing);
							lv_line_set_points(guider_ui.batteryline3, line_points_L_2, 2);     /*Set the points*/
							lv_obj_add_style(guider_ui.batteryline3, &style_line_L_2, 0);
							//lv_obj_center(line1);
							//lv_task_handler();  // Update the display


							// Line - 4
							//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
							//12 lines : x = 128/12 = 10.66 = 10+1
							// starting -- x = prev line ending (x +1)
							static lv_point_t line_points_L_3[] = { {BATTERY_LEFT_LINE_A_LINE_4_X_START, BATTERY_LEFT_LINE_A_LINE_4_Y_START}, {BATTERY_LEFT_LINE_A_LINE_4_X_END, BATTERY_LEFT_LINE_A_LINE_4_Y_END}};
							/*Create style*/
							static lv_style_t style_line_L_3;
							lv_style_init(&style_line_L_3);
							lv_style_set_line_width(&style_line_L_3, 12);
		#ifndef LEFT_DRAW_LINE_1_COLOR_RED
							lv_style_set_line_opa(&style_line_L_3, BATTERY_LINE_OPA);
							lv_style_set_line_color(&style_line_L_3, first_line_color);
		#else
							lv_style_set_line_color(&style_line_L_3, lv_palette_main(LV_PALETTE_RED));
		#endif
							lv_style_set_line_rounded(&style_line_L_3, false);
							/*Create a line and apply the new style*/
							//lv_obj_t * line4;
							guider_ui.batteryline4 = lv_line_create(guider_ui.screen_drawing_container_drawing);
							lv_line_set_points(guider_ui.batteryline4, line_points_L_3, 2);     /*Set the points*/
							lv_obj_add_style(guider_ui.batteryline4, &style_line_L_3, 0);
							//lv_obj_center(line1);
							//lv_task_handler();  // Update the display

