dinguluer/NXP_RT1170/MCUXpressoIDE_Project/MIMXRT1176_Project_TFT/source/Battery_draw.c
							// Line - 5
							//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
							//12 lines : x = 128/12 = 10.66 = 10+1
							// starting -- x = prev line ending (x +1)
							static lv_point_t line_points_L_4[] = { {BATTERY_LEFT_LINE_A_LINE_5_X_START, BATTERY_LEFT_LINE_A_LINE_5_Y_START}, {BATTERY_LEFT_LINE_A_LINE_5_X_END, BATTERY_LEFT_LINE_A_LINE_5_Y_END}};
							/*Create style*/
							static lv_style_t style_line_L_4;
							lv_style_init(&style_line_L_4);
							lv_style_set_line_width(&style_line_L_4, 12);
		#ifndef LEFT_DRAW_LINE_1_COLOR_RED
							lv_style_set_line_opa(&style_line_L_4, BATTERY_LINE_OPA);
							lv_style_set_line_color(&style_line_L_4, first_line_color);
		#else
							lv_style_set_line_color(&style_line_L_4, lv_palette_main(LV_PALETTE_RED));
		#endif
							lv_style_set_line_rounded(&style_line_L_4, false);
							/*Create a line and apply the new style*/
							//lv_obj_t * line5;
							guider_ui.batteryline5 = lv_line_create(guider_ui.screen_drawing_container_drawing);
							lv_line_set_points(guider_ui.batteryline5, line_points_L_4, 2);     /*Set the points*/
							lv_obj_add_style(guider_ui.batteryline5, &style_line_L_4, 0);
							//lv_obj_center(line1);
							//lv_task_handler();  // Update the display

							// Line - 6
							//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
							//12 lines : x = 128/12 = 10.66 = 10+1
							// starting -- x = prev line ending (x +1)
							static lv_point_t line_points_L_5[] = { {BATTERY_LEFT_LINE_A_LINE_6_X_START, BATTERY_LEFT_LINE_A_LINE_6_Y_START}, {BATTERY_LEFT_LINE_A_LINE_6_X_END, BATTERY_LEFT_LINE_A_LINE_6_Y_END}};
							/*Create style*/
							static lv_style_t style_line_L_5;
							lv_style_init(&style_line_L_5);
							lv_style_set_line_width(&style_line_L_5, 12);
		#ifndef LEFT_DRAW_LINE_1_COLOR_RED
							lv_style_set_line_opa(&style_line_L_5, BATTERY_LINE_OPA);
							lv_style_set_line_color(&style_line_L_5, first_line_color);
		#else
							lv_style_set_line_color(&style_line_L_5, lv_palette_main(LV_PALETTE_RED));
		#endif
							lv_style_set_line_rounded(&style_line_L_5, false);
							/*Create a line and apply the new style*/
							//lv_obj_t * line6;
							guider_ui.batteryline6 = lv_line_create(guider_ui.screen_drawing_container_drawing);
							lv_line_set_points(guider_ui.batteryline6, line_points_L_5, 2);     /*Set the points*/
							lv_obj_add_style(guider_ui.batteryline6, &style_line_L_5, 0);
							//lv_obj_center(line1);
							//lv_task_handler();  // Update the display

							// Line - 7
							//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
							//12 lines : x = 128/12 = 10.66 = 10+1
							// starting -- x = prev line ending (x +1)
							static lv_point_t line_points_L_6[] = { {BATTERY_LEFT_LINE_A_LINE_7_X_START, BATTERY_LEFT_LINE_A_LINE_7_Y_START}, {BATTERY_LEFT_LINE_A_LINE_7_X_END, BATTERY_LEFT_LINE_A_LINE_7_Y_END}};
							/*Create style*/
							static lv_style_t style_line_L_6;
							lv_style_init(&style_line_L_6);
							lv_style_set_line_width(&style_line_L_6, 12);
		#ifndef LEFT_DRAW_LINE_1_COLOR_RED
							lv_style_set_line_opa(&style_line_L_6, BATTERY_LINE_OPA);
							lv_style_set_line_color(&style_line_L_6, first_line_color);
		#else
							lv_style_set_line_color(&style_line_L_6, lv_palette_main(LV_PALETTE_RED));
		#endif
							lv_style_set_line_rounded(&style_line_L_6, false);
							/*Create a line and apply the new style*/
							//lv_obj_t * line7;
							guider_ui.batteryline7 = lv_line_create(guider_ui.screen_drawing_container_drawing);
							lv_line_set_points(guider_ui.batteryline7, line_points_L_6, 2);     /*Set the points*/
							lv_obj_add_style(guider_ui.batteryline7, &style_line_L_6, 0);
							//lv_obj_center(line1);
							//lv_task_handler();  // Update the display

							// Line - 8
							//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
							//12 lines : x = 128/12 = 10.66 = 10+1
							// starting -- x = prev line ending (x +1)
							static lv_point_t line_points_L_7[] = { {BATTERY_LEFT_LINE_A_LINE_8_X_START, BATTERY_LEFT_LINE_A_LINE_8_Y_START}, {BATTERY_LEFT_LINE_A_LINE_8_X_END, BATTERY_LEFT_LINE_A_LINE_8_Y_END}};
							/*Create style*/
							static lv_style_t style_line_L_7;
							lv_style_init(&style_line_L_7);
							lv_style_set_line_width(&style_line_L_7, 12);
		#ifndef LEFT_DRAW_LINE_1_COLOR_RED
							lv_style_set_line_opa(&style_line_L_7, BATTERY_LINE_OPA);
							lv_style_set_line_color(&style_line_L_7, first_line_color);
		#else
							lv_style_set_line_color(&style_line_L_7, lv_palette_main(LV_PALETTE_RED));
		#endif
							lv_style_set_line_rounded(&style_line_L_7, false);
							/*Create a line and apply the new style*/
							//lv_obj_t * line8;
							guider_ui.batteryline8 = lv_line_create(guider_ui.screen_drawing_container_drawing);
							lv_line_set_points(guider_ui.batteryline8, line_points_L_7, 2);     /*Set the points*/
							lv_obj_add_style(guider_ui.batteryline8, &style_line_L_7, 0);
							//lv_obj_center(line1);
							//lv_task_handler();  // Update the display

							// Line - 9
							//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
							//12 lines : x = 128/12 = 10.66 = 10+1
							// starting -- x = prev line ending (x +1)
							static lv_point_t line_points_L_8[] = { {BATTERY_LEFT_LINE_A_LINE_9_X_START, BATTERY_LEFT_LINE_A_LINE_9_Y_START}, {BATTERY_LEFT_LINE_A_LINE_9_X_END, BATTERY_LEFT_LINE_A_LINE_9_Y_END}};
							/*Create style*/
							static lv_style_t style_line_L_8;
							lv_style_init(&style_line_L_8);
							lv_style_set_line_width(&style_line_L_8, 12);
		#ifndef LEFT_DRAW_LINE_1_COLOR_RED
							lv_style_set_line_opa(&style_line_L_8, BATTERY_LINE_OPA);
							lv_style_set_line_color(&style_line_L_8, first_line_color);
		#else
							lv_style_set_line_color(&style_line_L_8, lv_palette_main(LV_PALETTE_RED));
		#endif
							lv_style_set_line_rounded(&style_line_L_8, false);
							/*Create a line and apply the new style*/
							//lv_obj_t * line9;
							guider_ui.batteryline9 = lv_line_create(guider_ui.screen_drawing_container_drawing);
							lv_line_set_points(guider_ui.batteryline9, line_points_L_8, 2);     /*Set the points*/
							lv_obj_add_style(guider_ui.batteryline9, &style_line_L_8, 0);
							//lv_obj_center(line1);
							//lv_task_handler();  // Update the display

							// Line - 10
							//12 lines : y = 12/12 = 1 --> each Y dec by 1 each time
							//12 lines : x = 128/12 = 10.66 = 10+1
							// starting -- x = prev line ending (x +1)
							static lv_point_t line_points_L_9[] = { {BATTERY_LEFT_LINE_A_LINE_10_X_START, BATTERY_LEFT_LINE_A_LINE_10_Y_START}, {BATTERY_LEFT_LINE_A_LINE_10_X_END, BATTERY_LEFT_LINE_A_LINE_10_Y_END}};
							/*Create style*/
							static lv_style_t style_line_L_9;
							lv_style_init(&style_line_L_9);
							lv_style_set_line_width(&style_line_L_9, 12);
		#ifndef LEFT_DRAW_LINE_1_COLOR_RED
							lv_style_set_line_opa(&style_line_L_9, BATTERY_LINE_OPA);
							lv_style_set_line_color(&style_line_L_9, first_line_color);
		#else
							lv_style_set_line_color(&style_line_L_9, lv_palette_main(LV_PALETTE_RED));
		#endif
							lv_style_set_line_rounded(&style_line_L_9, false);
							/*Create a line and apply the new style*/
							//lv_obj_t * line10;
							guider_ui.batteryline10 = lv_line_create(guider_ui.screen_drawing_container_drawing);
							lv_line_set_points(guider_ui.batteryline10, line_points_L_9, 2);     /*Set the points*/
							lv_obj_add_style(guider_ui.batteryline10, &style_line_L_9, 0);
							//lv_obj_center(line1);
							//lv_task_handler();  // Update the display

}
